Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_3 (Conv2D)            (None, 26, 26, 32)        320
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 13, 32)        0
_________________________________________________________________
dropout_3 (Dropout)          (None, 13, 13, 32)        0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 11, 11, 64)        18496
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 5, 5, 64)          0
_________________________________________________________________
dropout_4 (Dropout)          (None, 5, 5, 64)          0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 3, 3, 128)         73856
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 1, 1, 128)         0
_________________________________________________________________
dropout_5 (Dropout)          (None, 1, 1, 128)         0
_________________________________________________________________
flatten_1 (Flatten)          (None, 128)               0
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512
_________________________________________________________________
dense_3 (Dense)              (None, 25)                3225
=================================================================
Total params: 112,409
Trainable params: 112,409
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
215/215 [==============================] - 18s 85ms/step - loss: 2.6991 - acc: 0.1777 - val_loss: 1.6358 - val_acc: 0.4967
Epoch 2/10
215/215 [==============================] - 17s 79ms/step - loss: 1.2809 - acc: 0.5718 - val_loss: 0.8795 - val_acc: 0.6899
Epoch 3/10
215/215 [==============================] - 17s 78ms/step - loss: 0.7959 - acc: 0.7291 - val_loss: 0.5645 - val_acc: 0.8070
Epoch 4/10
215/215 [==============================] - 17s 78ms/step - loss: 0.5531 - acc: 0.8095 - val_loss: 0.4220 - val_acc: 0.8760
Epoch 5/10
215/215 [==============================] - 15s 70ms/step - loss: 0.4194 - acc: 0.8555 - val_loss: 0.3447 - val_acc: 0.8751
Epoch 6/10
215/215 [==============================] - 17s 77ms/step - loss: 0.3253 - acc: 0.8898 - val_loss: 0.2858 - val_acc: 0.9016
Epoch 7/10
215/215 [==============================] - 17s 79ms/step - loss: 0.2606 - acc: 0.9115 - val_loss: 0.2688 - val_acc: 0.8999
Epoch 8/10
215/215 [==============================] - 17s 78ms/step - loss: 0.2225 - acc: 0.9277 - val_loss: 0.2478 - val_acc: 0.9096
Epoch 9/10
215/215 [==============================] - 17s 77ms/step - loss: 0.1829 - acc: 0.9397 - val_loss: 0.1874 - val_acc: 0.9339
Epoch 10/10
215/215 [==============================] - 20s 91ms/step - loss: 0.1547 - acc: 0.9478 - val_loss: 0.1905 - val_acc: 0.9324
The time taken to execute is 171.77 seconds.


Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_6 (Conv2D)            (None, 26, 26, 32)        320
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 24, 24, 32)        9248
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 12, 12, 32)        0
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 10, 10, 64)        18496
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 8, 8, 64)          36928
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 6, 6, 64)          36928
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 3, 3, 64)          0
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 1, 1, 128)         73856
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 1, 1, 25)          3225
_________________________________________________________________
flatten_2 (Flatten)          (None, 25)                0
_________________________________________________________________
dense_4 (Dense)              (None, 25)                650
=================================================================
Total params: 179,651
Trainable params: 179,651
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
215/215 [==============================] - 40s 188ms/step - loss: 1.4772 - acc: 0.5365 - val_loss: 0.8180 - val_acc: 0.7157
Epoch 2/10
215/215 [==============================] - 37s 173ms/step - loss: 0.1351 - acc: 0.9563 - val_loss: 0.7998 - val_acc: 0.8175
Epoch 3/10
215/215 [==============================] - 38s 178ms/step - loss: 0.0406 - acc: 0.9881 - val_loss: 0.8043 - val_acc: 0.8678
Epoch 4/10
215/215 [==============================] - 41s 192ms/step - loss: 7.5384e-04 - acc: 1.0000 - val_loss: 0.8480 - val_acc: 0.8678
Epoch 5/10
215/215 [==============================] - 41s 193ms/step - loss: 2.3079e-04 - acc: 1.0000 - val_loss: 0.8934 - val_acc: 0.8726
Epoch 6/10
215/215 [==============================] - 38s 176ms/step - loss: 1.3704e-04 - acc: 1.0000 - val_loss: 0.9131 - val_acc: 0.8742
Epoch 7/10
215/215 [==============================] - 37s 172ms/step - loss: 9.6669e-05 - acc: 1.0000 - val_loss: 0.9502 - val_acc: 0.8720
Epoch 8/10
215/215 [==============================] - 37s 173ms/step - loss: 6.9356e-05 - acc: 1.0000 - val_loss: 0.9625 - val_acc: 0.8717
Epoch 9/10
215/215 [==============================] - 38s 177ms/step - loss: 5.3583e-05 - acc: 1.0000 - val_loss: 0.9969 - val_acc: 0.8713
Epoch 10/10
215/215 [==============================] - 37s 173ms/step - loss: 4.1687e-05 - acc: 1.0000 - val_loss: 1.0076 - val_acc: 0.8735
The time taken to execute is 388.05 seconds.



Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d_13 (Conv2D)           (None, 26, 26, 32)        320
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 13, 13, 32)        0
_________________________________________________________________
dropout_6 (Dropout)          (None, 13, 13, 32)        0
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 11, 11, 64)        18496
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 5, 5, 64)          0
_________________________________________________________________
dropout_7 (Dropout)          (None, 5, 5, 64)          0
_________________________________________________________________
flatten_3 (Flatten)          (None, 1600)              0
_________________________________________________________________
dense_5 (Dense)              (None, 25)                40025
=================================================================
Total params: 58,841
Trainable params: 58,841
Non-trainable params: 0
_________________________________________________________________
Epoch 1/10
215/215 [==============================] - 15s 68ms/step - loss: 1.7421 - acc: 0.5053 - val_loss: 0.8635 - val_acc: 0.7373
Epoch 2/10
215/215 [==============================] - 15s 71ms/step - loss: 0.4500 - acc: 0.8671 - val_loss: 0.4969 - val_acc: 0.8373
Epoch 3/10
215/215 [==============================] - 15s 71ms/step - loss: 0.1994 - acc: 0.9455 - val_loss: 0.3675 - val_acc: 0.8887
Epoch 4/10
215/215 [==============================] - 14s 64ms/step - loss: 0.1061 - acc: 0.9749 - val_loss: 0.3327 - val_acc: 0.8977
Epoch 5/10
215/215 [==============================] - 15s 71ms/step - loss: 0.0645 - acc: 0.9858 - val_loss: 0.2913 - val_acc: 0.9172
Epoch 6/10
215/215 [==============================] - 17s 80ms/step - loss: 0.0408 - acc: 0.9923 - val_loss: 0.2933 - val_acc: 0.9200
Epoch 7/10
215/215 [==============================] - 17s 78ms/step - loss: 0.0308 - acc: 0.9942 - val_loss: 0.2599 - val_acc: 0.9368
Epoch 8/10
215/215 [==============================] - 18s 85ms/step - loss: 0.0234 - acc: 0.9954 - val_loss: 0.2800 - val_acc: 0.9250
Epoch 9/10
215/215 [==============================] - 15s 69ms/step - loss: 0.0182 - acc: 0.9969 - val_loss: 0.2771 - val_acc: 0.9246
Epoch 10/10
215/215 [==============================] - 14s 65ms/step - loss: 0.0143 - acc: 0.9977 - val_loss: 0.2924 - val_acc: 0.9272
The time taken to execute is 156.84 seconds.


# Results
Accuracy Score for model1 =  0.9323759063022866
Accuracy Score for model2 =  0.8735359732292247
Accuracy Score for model3 =  0.9272169548243168
Accuracy Score for average ensemble =  0.9393474623535973


# Give some logical weights to the models according to their accuracy scores
weights = [0.45, 0.2, 0.35]

# Results
Accuracy Score for model1 =  0.9323759063022866
Accuracy Score for model2 =  0.8735359732292247
Accuracy Score for model3 =  0.9272169548243168
Accuracy Score for average ensemble =  0.9393474623535973
Accuracy Score for weighted average ensemble =  0.9422755158951478


# Results with optimal weights
Max accuracy of  94.7016174010039  obained with w1=0.3  w2=0.1  and w3=0.2